#include <stdio.h>

/*
*Написати рекурсивну функцію обчислення НCД за допомогою
алгоритму Евкліда.
 */

int gcd(int a, int b); // знайходження НСД за допомогою рекурсивного алгоритма Евкліда. Як і в самому алгоритмі
//ми кожен раз знаходимо остачі від ділення, доки не дійдємо до 0. a, b - числа у яких треба знайти НСД

int main(void) {
    int a, b;
    // отримання чисел
    puts("Input two numbers");
    scanf("%d %d", &a, &b);
    //виведення нсд
    printf("NSD: %d", gcd(a, b));
    return 0;
}

int gcd(int a, int b) {
    if (b == 0) { // якщо дійшли до остачі = 0, то значить a - і є НСД
        return a;
    }
    return gcd(b, a % b); // перевіряємо наступну пару остач/чисел.
}